cask_args appdir: "/Applications"

# brew tap(s)
tap "homebrew/cask"
# for font support
tap "homebrew/cask-fonts"

# regular brew(s)
brew "mas"
brew "node"
brew "rustup-init"
brew "sqlite"
brew "tree"
brew "wget"

# application cask(s)
cask "cyberduck"
cask "discord"
cask "firefox"
cask "keka"
cask "notion"
cask "numi"
cask "postico"
cask "protonvpn"
cask "rectangle"
cask "tg-pro"
cask "sublime-text"
cask "sublime-merge"
cask "visual-studio-code"
cask "vlc"

# font cask(s)
cask "font-fira-code"
cask "font-fira-mono"
cask "font-fira-sans"
cask "font-fira-code-nerd-font"
cask "font-cascadia-code"
cask "font-cascadia-code-pl"
