cask_args appdir: '/Applications'

# brew tap(s)
tap 'homebrew/cask'
# for font support
tap 'homebrew/cask-fonts'

# regular brew(s)
brew 'mas'
brew 'node'
brew 'rustup-init'
brew 'sqlite'
brew 'tree'
brew 'wget'

# application cask(s)
cask 'cyberduck'
cask 'discord'
cask 'firefox'
cask 'keka'
cask 'notion'
cask 'numi'
cask 'postico'
cask 'postgres-unofficial'
cask 'protonvpn'
cask 'rectangle'
cask 'tg-pro'
cask 'visual-studio-code'
cask 'zoomus'

# font cask(s)
cask 'font-fira-code'
cask 'font-fira-mono'
cask 'font-fira-sans'
cask 'font-fira-code-nerd-font'
cask 'font-cascadia-code'
cask 'font-cascadia-code-pl'

# Mac App Store app(s)
mas 'Amphetamine', id: 937984704
mas 'Calcbot', id: 931657367
mas 'Textual 7', id: 1262957439
mas 'Microsoft OneNote' id: 784801555
mas 'Microsoft Outlook' id: 985367838
mas 'Microsoft Word' id: 462054704
mas 'Microsoft Excel' id: 462058435
mas 'Microsoft Remote Desktop' id: 1295203466
mas 'Microsoft To Do' id: 1274495053
